NextFOAM-2409/tutorials/verificationAndValidation/multiphase/interIsoFoam/porousDamBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue porosity 1
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.281 0.24 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box (0.281 0 -1) (0.892 0.022 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box (0.30 0 -1) (0.59 0.3 1);

        fieldValues
        (
            volScalarFieldValue porosity 0.49
        );
    }
);


// ************************************************************************* //
